# Taps
tap "cloudflare/cloudflare"
tap "int128/kubelogin"
tap "isen-ng/dotnet-sdk-versions"

# Apps
brew "sqlite"
brew "azure-cli"
brew "c-ares"
brew "gettext"
brew "cairo"
brew "git"
brew "git-lfs"
brew "libnghttp2"
brew "lychee"
brew "gnupg"
brew "openjdk"
brew "mas"
brew "maven"
brew "nmap"
brew "node@22", link: true
brew "openjdk@11"
brew "pinentry-mac"
brew "sdl2"
brew "sphinx-doc"
brew "telnet"
brew "wget"
brew "yarn"
brew "int128/kubelogin/kubelogin"
cask "1password"
cask "betterdisplay"
cask "cameracontroller"
cask "discord"
cask "displaylink"
cask "docker"
cask "dotnet-sdk6"
cask "dotnet-sdk7"
cask "dotnet-sdk8"
cask "dotnet-sdk9"
cask "dotnet-sdk10"
cask "emclient"
cask "gh"
cask "google-chrome"
cask "google-drive"
cask "gstreamer-runtime"
cask "handbrake"
cask "iterm2"
cask "jan"
cask "jetbrains-toolbox"
cask "krisp"
cask "mmex"
cask "ngrok"
cask "onedrive"
cask "signal"
cask "skype"
cask "slack"
cask "telegram-desktop"
cask "unnaturalscrollwheels"
cask "utm"
cask "visual-studio-code"
cask "whatsapp"

# VS Code Extensions
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"

# Fonts
cask 'font-arial'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
cask 'font-heebo'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Lunacy', id: 1582493835
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Powerpoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator Pro', id: 1289583905
mas 'Tailscale', id: 1475387142
mas 'Windows App', id: 1295203466
mas 'Wireguard', id: 1451685025
mas 'Xcode', id: 497799835